
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АналогиНоменклатуры
	Движения.АналогиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
		Движение = Движения.АналогиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.Характеристика = Характеристика;
		Движение.Аналог = ТекСтрокаСписокНоменклатуры.Аналог;
		Движение.ХарактеристикаАналога = ТекСтрокаСписокНоменклатуры.ХарактеристикаАналога;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
