
&НаСервере
Процедура ПрепаратПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АналогиНоменклатурыСрезПоследних.Аналог КАК Аналог
	|ПОМЕСТИТЬ ТАналоги
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК АналогиНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.Характеристика КАК Характеристика,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Остаток,
	|	ЦеныПоставщиковСрезПоследних.Цена * ОстаткиНоменклатурыОстатки.КоличествоОстаток * 1.2 КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				ИЛИ Номенклатура В
	|					(ВЫБРАТЬ
	|						ТАналоги.Аналог КАК Аналог
	|					ИЗ
	|						ТАналоги КАК ТАналоги)) КАК ОстаткиНоменклатурыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоставщиков.СрезПоследних КАК ЦеныПоставщиковСрезПоследних
	|		ПО ОстаткиНоменклатурыОстатки.Номенклатура = ЦеныПоставщиковСрезПоследних.Номенклатура
	|			И ОстаткиНоменклатурыОстатки.Характеристика = ЦеныПоставщиковСрезПоследних.Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Препарат);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ, "Препараты");
КонецПроцедуры

&НаКлиенте
Процедура ПрепаратПриИзменении(Элемент)
	ПрепаратПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Ном = ПараметрыПеретаскивания.Значение[0];
	НовСтр = Объект.СписокНоменклатуры.Добавить();
	НовСтр.Номенклатура = Ном.Номенклатура;
	НовСтр.Характеристика = Ном.Характеристика;
	НовСтр.Цена = Ном.Стоимость / Ном.Остаток;
КонецПроцедуры

&НаСервере
Процедура НазначениеПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.Характеристика КАК Характеристика,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Остаток,
	|	ЦеныПоставщиковСрезПоследних.Цена * ОстаткиНоменклатурыОстатки.КоличествоОстаток * 1.2 КАК Стоимость
	|ИЗ
	|	Справочник.Назначения КАК Назначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки КАК ОстаткиНоменклатурыОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоставщиков.СрезПоследних КАК ЦеныПоставщиковСрезПоследних
	|				ПО ОстаткиНоменклатурыОстатки.Номенклатура = ЦеныПоставщиковСрезПоследних.Номенклатура
	|					И ОстаткиНоменклатурыОстатки.Характеристика = ЦеныПоставщиковСрезПоследних.Характеристика
	|			ПО ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка = ОстаткиНоменклатурыОстатки.Характеристика
	|		ПО Назначения.Ссылка = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Характеристика
	|ГДЕ
	|	Назначения.Ссылка = &Назначение";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ, "Препараты");
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	НазначениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВеществоПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.Характеристика КАК Характеристика,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Остаток,
	|	ЦеныПоставщиковСрезПоследних.Цена * ОстаткиНоменклатурыОстатки.КоличествоОстаток * 1.2 КАК Стоимость
	|ИЗ
	|	Справочник.ДействующиеВещества КАК ДействующиеВещества
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки КАК ОстаткиНоменклатурыОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоставщиков.СрезПоследних КАК ЦеныПоставщиковСрезПоследних
	|				ПО ОстаткиНоменклатурыОстатки.Номенклатура = ЦеныПоставщиковСрезПоследних.Номенклатура
	|					И ОстаткиНоменклатурыОстатки.Характеристика = ЦеныПоставщиковСрезПоследних.Характеристика
	|			ПО ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка = ОстаткиНоменклатурыОстатки.Характеристика
	|		ПО ДействующиеВещества.Ссылка = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Характеристика
	|ГДЕ
	|	ДействующиеВещества.Ссылка = &ДействующееВещество";
	
	Запрос.УстановитьПараметр("ДействующееВещество", Вещество);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ, "Препараты");
КонецПроцедуры

&НаКлиенте
Процедура ВеществоПриИзменении(Элемент)
	ВеществоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекСтр = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекСтр.Сумма = ТекСтр.Цена * ТекСтр.Количество;
КонецПроцедуры
