
//&НаКлиенте
//Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
//	ТекСтр = Элементы.СписокНоменклатуры.ТекущиеДанные;
//	Если ТекСтр <> Неопределено Тогда
//		Отбор = Новый ФиксированнаяСтруктура("НомерСтроки", ТекСтр.НомерСтроки);
//		Элементы.Аналоги.ОтборСтрок = Отбор;
//	КонецЕсли;
//КонецПроцедуры


//&НаКлиенте
//Процедура АналогиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
//	Элементы.Аналоги.ТекущиеДанные.НомерСтроки = Элементы.Аналоги.ОтборСтрок.НомерСтроки;
//КонецПроцедуры

