
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Наименование = "";
	Для Каждого ТекСтр Из Объект.ДополнительныеРеквизиты Цикл
		Наименование = Наименование + ТекСтр.Свойство + ":" + "(" + ТекСтр.Характеристика + ");";
	КонецЦикла;
	ТекущийОбъект.Наименование = Наименование;
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвойстваНоменклатуры.Свойство КАК Свойство,
	|	NULL КАК Характеристика
	|ИЗ
	|	РегистрСведений.СвойстваНоменклатуры КАК СвойстваНоменклатуры
	|ГДЕ
	|	СвойстваНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Владелец);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.ДополнительныеРеквизиты.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры
